#Реализовать поиск дат в тексте, записанных в виде чисел, разделенных пробелом, тире, точкой, слэшем
import re

def reg():   
	nomera = """
		05 01 2000 12-06-1945, 11.05.1245, 10/09/2009, 00.12.2001
			"""
	pat = re.compile(r'(?<!\d)(?:0?[1-9]|[12][0-9]|3[01]).(?:0?[1-9]|1[0-2]).\d{4}') 
	res = [str(i).replace('.', ' ').replace('/', ' ').replace(' ', '-') + ';\n' for i in pat.findall(nomera)]
	for el in res:
		print('{:<30}'.format(el))
reg()
